
<body style="background-color: #ccff66">
    <?php
//1-class.php
    //обектно ориентирано програмиране(ООП) 
    //1. класове и обекти
    //С класовете се описват елемнти н системата и техните характеристики и функционалност
    //Те представляват набор от дефиниции на променливи и функции  свързани с конкретен елемент 
    //целта е да се правят преизползваеми компоненти 
    //всеки обект при съдаване поличава собствени коопия на харакктеристики и функции които нямат общо тез същите от същия клас
    //обекта е променли от тип ОБЕКТ->Object;като има и втори тип и това екласа на който е инстанция.
    //Характеристиките се наричат член_променливи (Properties)
  //и са недостъпни извън тялото на класа, защото достъпа до тях става чрез обект 
  //със синтакс за достъп до проперти без да се ползва знак за долар :)
    //
    //констатите са част от класа а не от обекта 
    //достъпа до тях става чрез името на класа последван от оператора за обхват на действие (::)
    //последвано от името на константата
    
    /**
     * клас MyTest
     * podrobno opisanie  цел, употреба и други 
     */
class MyTest
{
    
    const MY_CLASS_CONSTANT='this is class constant';
    /**
     *кратко описание  
     * подробно описание  
     */
    public $myProperty=123;
    public function __construct(int $myProp=null) {
        //конструктор на обект ;
        if($myProp!==null){
        $this->myProperty=$myProp;}
        
    }
    public function myMethod()
    {
        return rand(1,11);
    }
}

$myObject=new MyTest();
//правим инициализация на метод май-Метод;
echo $myObject->myMethod();
echo'<br/>';
$myObject->myProperty=444;
//създаване на обект май-тест 
$myObject2= new MyTest(123456);

var_dump($myObject,
        $myObject2,
        $myObject->myMethod(),
        MyTest::MY_CLASS_CONSTANT);